<template>
  <section id="advantages-index" class="advantages-index">
    <div class="container">
      <div class="row">
        <div v-for="(item, index) in items" :key="index" class="col-lg-4">
          <div class="advantages-item">
            <img
              :src="item.img"
              alt="Природа и городской комфорт"
            >
            <div class="h7" v-html="item.title"></div>
            <div class="text mt-10">
              {{ item.text }}
            </div>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>
<script setup lang="ts">

const items = [
  {
    title: 'Природа и городской <br> комфорт',
    text: 'Экосистема жилого комплекса с комфортной и доступной средой для всех возрастов, с детской развивающей и спортивной инфраструктурой в окружении живой природы. Транспортная развязка предусматривает движение во все направления в 5 минутах ходьбы находятся остановки общественного транспорта с 17 маршрутами.',
    img: '/images/sections/nature.png'
  },
  {
    title: 'Наслаждайтесь комфортом и пространством',
    text: 'Встречайтесь с друзьями, отдыхайте с детьми и занимайтесь спортом в своём собственном «центре города». Чтобы на наслаждение жизнью оставалось больше времени в жилом комплексе предусмотрено все необходимое: супермаркет, спортивный комплекс с бассейном, детский сад, творческие студии, салон красоты.',
    img: '/images/sections/pleasure.png'
  },
  {
    title: 'Знайте, что ваш дом - это не только квартира',
    text: 'Двор, в котором приоритет отдан человеку, – это безопасное пространство без машин на закрытой территории, с множеством развлечений для детей и спокойного отдыха взрослых. Благодаря продуманной посадке зданий, двор остаётся светлым в любое время года, а при желании, можно будет отдохнуть в тени высоких деревьев, бережно сохранённых застройщиком.',
    img: '/images/sections/family.png'
  }
]

</script>
